/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package org.jhrcore.msg.pay;

import org.jhrcore.ui.language.WebHrMessage;

/**
 *
 * @author mxliteboss
 */
public enum PayBonusMsg {

    ttl001("快速输入查询字段设置"),
    ttl002("添加奖金人员"),
    ttl003("引入奖金项目 当前体系:"),
    ttl004("新增奖金项目"),
    ttl005("快速查找"),
    ttl006("导入模板"),
    ttl007("请选择"),
    ttl008("奖金项目"),
    ttl009("奖金项选择："),
    ttl010("薪酬体系选择："),
    ttl011("无奖金纪录"),
    msg001("删除无数据的状态记录成功"),
    msg002("请选择薪酬体系"),
    msg003("请选择奖金项目"),
    msg004(" 奖金项目已发放,不能执行删除操作。"),
    msg005("请选择汇总的体系"),
    msg006("当前体系 "),
    msg007(" 月份个人奖金总额汇总成功"),
    msg008("请选择按次数查询"),
    msg009("发放成功"),
    msg010("取消发放成功"),
    msg011("发放"),
    msg012("取消发放"),
    msg013("确定"),
    msg014("体系下所有奖金项目的"),
    msg015("第"),
    msg016("次奖金？"),
    msg017("请输入有效的年月"),
    msg018("请输入有效的次数"),
    msg019("输入次数不能为零"),
    msg020("请输入有效的默认金额"),
    msg021("奖金项目名称不能为空"),
    msg022("奖金项目名称在体系中已存在"),
    msg023("奖金项目编码在体系中已存在"),
    msg024("请选择一个工资体系"),
    msg025("引入成功"),
    msg026("请先输入新增发放月份"),
    msg027("请先输入新增发放次数"),
    msg028("导入消息报告如下："),
    msg029( " 成功插入记录： "),
    msg030(" 成功更新记录： "),
    msg031(" 无匹配项或匹配不到的记录："),
    msg032(" 序号已存在的记录：" ),
    msg033(" 数据格式有误的记录： "),
    msg034(" 数据库更新错误的记录："),
    msg035("条;"),
    msg036("请先处理已选择Excel文件"),
    msg037("请选择匹配项"),
    msg038("请选择奖金项"),
    msg039("请选择年月"),
    msg040("请选择次数"),
    msg041("文件读取错误，请确认Excel文件（检查表头批注）"),
    msg042("请确认Excel文件（检查表头批注）"),
    msg043("请确认Excel文件的列名是否属于该表"),
    msg044("导入文件中不包含匹配列,如果选择不是人员编号列，则匹配列的标注格式如‘#A01.a0177’"),
    msg045("导入文件中不包含序号（a_id）列"),
    msg046("导入文件中不包含奖金项目名称列"),
    msg047("请输入正确的金额"),
    msg048("没有需要保存的数据"),
    msg049("月份"),
    msg050("次已发放"),
    msg051("请到奖金管理界面的工具中快速输入查询字段设置"),
    msg052("请输入人员查询信息"),
    msg053("请输入正确的年月"),
    msg054("请输入正确的次数"),
    msg055("请输入正确的奖金次数"),
    msg056("找不到选择人员的工资部门"),
    msg057("工资数据中找不到该人员，请核对查询信息及工资体系和是否已生成人员工资"),
    msg058("年月格式不对。例如:201110"),
    msg059("次数不对。例如:1"),
    msg060("次奖金已发放"),
    msg061("新增记录为空"),
    msg062("所选部门不能为空"),
    msg063("所选条件不能为空"),
    msg064("该奖金项目对于的薪酬体系还没有生成新表"),
    msg065("请先保存目前奖金项的新增记录"),
    msg066("工资为已发放状态，奖金不能取消发放"),
    msg067("当月没有设置该奖金项目"),
    msg068("保存成功"),
    msg069("引入其他月份奖金项目"),
    msg070("确定引入奖金项目？");
    private String value;

    private PayBonusMsg() {
    }

    private PayBonusMsg(String value) {
        this.value = value;

    }

    @Override
    public String toString() {
        return WebHrMessage.getMsgString(PayBonusMsg.class, this.name(), this.value);
    }
}
